posts/reproducible-research-1.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>A setup for reproducible research</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Deepak Cherian">
<meta name="keywords" content="reproducible; research; physical oceanography, eddies, science, ocean,">
<link rel="stylesheet" href="../research-posts.css" type="text/css" />
<link href="https://fonts.googleapis.com/css?family=Fira+Sans:300,400,500" rel="stylesheet">
</head>
<body>
<div id="preamble" class="status">
<p class="post-subtitle"><a class="animate-link back" href="../index.html"> ← Back</a> |  Deepak Cherian | 19 Jan 2017</p>
</div>
<div id="content">
<header>
<h1 class="title">A setup for reproducible research</h1>
</header>
<section id="outline-container-orgbcad169" class="outline-2">
<h2 id="orgbcad169">Update</h2>
<div class="outline-text-2" id="text-orgbcad169">
<p>
<a href="https://www.researchgate.net/profile/Andre_Paloczy">André Palóczy</a> has implemented some of <a href="https://github.com/apaloczy/reproducibility">these ideas in Python</a>.
</p>
</div>
</section>
<section id="outline-container-orgc8c95ec" class="outline-2">
<h2 id="orgc8c95ec">Software</h2>
<div class="outline-text-2" id="text-orgc8c95ec">
<ul class="org-ul">
<li>Version control system to track content. I use <a href="http://www.git-scm.org"><code>git</code></a>.</li>
<li><a href="http://www.sno.phy.queensu.ca/~phil/exiftool/"><code>exiftool</code></a> to read and write metadata to images</li>
<li>I have some code below for MATLAB but the principles could be extended to any other software package.</li>
</ul>
</div>
</section>
<section id="outline-container-org451bf76" class="outline-2">
<h2 id="org451bf76">Strategy</h2>
<div class="outline-text-2" id="text-org451bf76">
<p>
The approach is simple: use <code>git</code> to track files that generate output.
</p>

<p>
<code>git</code> automatically assigns a unique 40 character alphanumeric string (a "hash") that identifies the state of a repository.
</p>

<p>
By saving the value of the hash when a certain output file is created, we know what code created the output.
</p>

<p>
With data files, it is simple to add an extra variable containing the hash.
</p>

<p>
With figures, I use the metadata fields to save the hash value.
</p>
</div>
</section>
<section id="outline-container-org53d314a" class="outline-2">
<h2 id="org53d314a">Getting the current hash in MATLAB</h2>
<div class="outline-text-2" id="text-org53d314a">
<p>
The following MATLAB function <code>githash</code> will return the hash of the last commit that modified the file in <code>fname</code>. If not provided with <code>fname</code> it returns the hash of the last commit in the repository.
</p>

<div class="org-src-container">
<pre class="src src-matlab">   <span style="color: #859900; font-weight: bold;">function</span> <span style="color: #268bd2;">[hash]</span> = <span style="color: #268bd2;">githash</span>(<span style="color: #268bd2;">fname</span>, <span style="color: #268bd2;">gitdir</span>)

       <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">~</span>exist(<span style="color: #2aa198;">'fname'</span>, <span style="color: #2aa198;">'var'</span>)
           fname = <span style="color: #2aa198;">'.'</span>;
       <span style="color: #859900; font-weight: bold;">end</span>

       <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">~</span>exist(<span style="color: #2aa198;">'gitdir'</span>, <span style="color: #2aa198;">'var'</span>)
           gitdir = <span style="color: #2aa198;">''</span>;
       <span style="color: #859900; font-weight: bold;">else</span>
           gitdir = [<span style="color: #2aa198;">'--git-dir='</span> gitdir];
       <span style="color: #859900; font-weight: bold;">end</span>

       [<span style="color: #b58900;">~</span>, hashout] = system([<span style="color: #2aa198;">'TERM=xterm git '</span> gitdir ...
                           <span style="color: #2aa198;">' log -n 1 --no-color --pretty=format:''%H'' '''</span> ...
                           fname <span style="color: #2aa198;">''' &lt; /dev/null'</span>]);

       <span style="color: #93a1a1;">% remove bash escape characters</span>
       hash = hashout(9<span style="color: #b58900;">:</span>48)
   <span style="color: #859900; font-weight: bold;">end</span>
</pre>
</div>

<p>
Using it in a MATLAB script requires the incantation
</p>
<div class="org-src-container">
<pre class="src src-matlab">  hash = githash([mfilename(<span style="color: #2aa198;">'fullpath'</span>) <span style="color: #2aa198;">'.m'</span>]);
</pre>
</div>
<p>
This provides <code>githash</code> with the path to the current mfile that is calling <code>githash</code>.
</p>

<p>
Quite frequently, I calculate diagnostics that take a while which means that rerunning them every time I make an image is not feasible. I save the <code>hash</code> variable to the file containing diagnostic output. This lets me know what version of the code created that version of the saved output.
</p>
</div>
</section>

<section id="outline-container-orgc0f8ee2" class="outline-2">
<h2 id="orgc0f8ee2">Using the hash</h2>
<div class="outline-text-2" id="text-orgc0f8ee2">
<p>
MATLAB's FileExchange has a couple of useful scripts <a href="https://www.mathworks.com/matlabcentral/fileexchange/43179-insert-annotation-in-figure-s-metadata"><code>insertAnnotation</code> &amp; <code>getAnnotation</code></a> that insert and recover metadata in MATLAB figure windows.
</p>

<p>
An obvious choice is to save the hash. More importantly, one can save the exact function call that generated a figure. Then, you know two things:
</p>
<ol class="org-ol">
<li>the version of the code that created the figure, and</li>
<li>all parameters provided to the code;</li>
</ol>
<p>
both of which are saved in the metadata of the figure <i>itself</i>.
</p>

<p>
<code>getAnnotation</code> can then recover the saved metadata when saving a figure to file.
</p>
</div>
</section>

<section id="outline-container-org5713797" class="outline-2">
<h2 id="org5713797">Saving the hash in an image file</h2>
<div class="outline-text-2" id="text-org5713797">
<p>
Once you have a hash value, or any metadata in general, it needs to be saved when the image is saved. I have modified <code>export_fig</code> (<a href="https://github.com/altmany/export_fig">original</a>, <a href="https://github.com/dcherian/export_fig">my fork</a>) to do this for me.
</p>

<p>
In general, all you need is a line that looks like
</p>
<div class="org-src-container">
<pre class="src src-matlab">  system([<span style="color: #2aa198;">'exiftool -overwrite_original -Producer='</span> ...
          hash <span style="color: #2aa198;">' '</span> pdf_nam]);
</pre>
</div>
<p>
The above tells exiftool to save the contents of variable <code>hash</code> in the metadata field <code>Producer</code> of the file named <code>pdf_nam</code>. The slight complication here is that the metadata field names are not standardized among different image formats.
</p>

<table>
<caption class="t-above"><span class="table-number">Table 1:</span> Metadata fields for various image formats that I use to save hashes.</caption>

<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>format</b></td>
<td class="org-left">pdf, eps</td>
<td class="org-left">png</td>
<td class="org-left">jpg</td>
<td class="org-left">tif</td>
</tr>

<tr>
<td class="org-left"><b>metadata field</b></td>
<td class="org-left">Producer</td>
<td class="org-left">Software</td>
<td class="org-left">Comment</td>
<td class="org-left">Description</td>
</tr>
</tbody>
</table>

<p>
<code>exiftool</code> is only required to modify the metadata fields of PDF and EPS files. MATLAB's <code>imwrite</code> can write metadata to bitmap files (e.g. PNG).
</p>

<p>
Searching for <code>hash</code> in my fork of <a href="https://github.com/dcherian/export_fig/blob/master/export_fig.m"><code>export_fig.m</code></a> will show you how <code>imwrite</code> can be used.
</p>
</div>
</section>

<section id="outline-container-org54c0314" class="outline-2">
<h2 id="org54c0314">Extracting commit hash from image metadata</h2>
<div class="outline-text-2" id="text-org54c0314">
<p>
To recover the recorded hash, it suffices to call <code>exiftool FILENAME</code> which will print all metadata stored in the image; not just the hash. <code>grep</code> can then find the recorded hash:
</p>
<div class="org-src-container">
<pre class="src src-bash">  <span style="color: #93a1a1;">#</span><span style="color: #93a1a1;">!/bin/bash</span>
  <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">displays saved git hash of a provided file using exiftool</span>

  <span style="color: #268bd2;">file</span>=$<span style="color: #268bd2;">1</span>
  <span style="color: #268bd2;">hash</span>=$(<span style="color: #6c71c4; font-weight: bold;">exiftool</span> $<span style="color: #268bd2;">file</span> | grep -i <span style="color: #2aa198;">"hash:"</span>)

  <span style="color: #657b83; font-weight: bold;">echo</span> $<span style="color: #268bd2;">hash</span>
</pre>
</div>
</div>
</section>
</div>
<div id="postamble" class="status">
<svg style="position: absolute; width: 0; height: 0; overflow: hidden;" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink">
<defs>

<symbol id="icon-cc-by" viewBox="0 0 91 32">
  <title>Creative Commons Attribution License</title>
  <desc>Creative Commons Attribution License</desc>
<path fill="#aab2ab" style="fill: var(--color1, #aab2ab)" d="M2.392 0.387l86.365 0.153c1.207 0 2.285-0.179 2.285 2.408l-0.106 28.441h-90.723v-28.547c0-1.276 0.123-2.456 2.179-2.456z"></path>
<path fill="#000" style="fill: var(--color2, #000)" d="M89.716 0h-88.004c-0.944 0-1.712 0.768-1.712 1.712v29.902c0 0.213 0.173 0.386 0.387 0.386h90.655c0.213 0 0.387-0.173 0.387-0.386v-29.902c0-0.944-0.768-1.712-1.713-1.712zM1.712 0.773h88.004c0.518 0 0.939 0.421 0.939 0.938 0 0 0 12.074 0 20.782h-63.105c-2.305 4.168-6.747 6.999-11.845 6.999-5.1 0-9.54-2.828-11.845-6.999h-3.087c0-8.708 0-20.782 0-20.782 0-0.518 0.421-0.938 0.939-0.938z"></path>
<path fill="#fff" style="fill: var(--color3, #fff)" d="M56.235 24.95c0.24 0 0.46 0.021 0.659 0.064s0.367 0.112 0.509 0.209c0.141 0.096 0.251 0.225 0.329 0.384s0.117 0.358 0.117 0.594c0 0.254-0.058 0.466-0.174 0.635s-0.287 0.308-0.513 0.417c0.312 0.089 0.545 0.246 0.699 0.47s0.231 0.494 0.231 0.81c0 0.254-0.050 0.475-0.149 0.661s-0.233 0.338-0.4 0.455c-0.168 0.118-0.359 0.206-0.574 0.262s-0.436 0.085-0.663 0.085h-2.45v-5.045h2.379zM56.093 26.991c0.198 0 0.361-0.047 0.489-0.141s0.191-0.246 0.191-0.458c0-0.118-0.021-0.214-0.064-0.289s-0.099-0.134-0.17-0.177c-0.071-0.042-0.152-0.072-0.244-0.088s-0.188-0.024-0.286-0.024h-1.040v1.177h1.125zM56.158 29.132c0.109 0 0.212-0.010 0.311-0.032s0.186-0.057 0.263-0.106c0.075-0.050 0.135-0.117 0.18-0.202s0.067-0.193 0.067-0.325c0-0.259-0.073-0.444-0.22-0.555s-0.34-0.166-0.58-0.166h-1.211v1.384h1.19z"></path>
<path fill="#fff" style="fill: var(--color3, #fff)" d="M58.288 24.95h1.244l1.182 1.993 1.174-1.993h1.237l-1.873 3.109v1.936h-1.112v-1.964l-1.852-3.081z"></path>
<path fill="#fff" style="fill: var(--color3, #fff)" d="M26.098 14.938c0.004 5.737-4.645 10.39-10.382 10.394s-10.391-4.644-10.395-10.381c0-0.004 0-0.008 0-0.013-0.003-5.737 4.645-10.39 10.382-10.393s10.391 4.644 10.395 10.381c0 0.004 0 0.008 0 0.012z"></path>
<path fill="#000" style="fill: var(--color2, #000)" d="M24.155 6.477c2.304 2.303 3.456 5.124 3.456 8.461s-1.132 6.128-3.396 8.372c-2.403 2.364-5.242 3.545-8.519 3.545-3.237 0-6.028-1.172-8.371-3.516s-3.515-5.144-3.515-8.401c0-3.257 1.172-6.077 3.515-8.461 2.284-2.304 5.074-3.456 8.371-3.456 3.337 0 6.156 1.152 8.46 3.456zM8.875 8.027c-1.948 1.967-2.921 4.271-2.921 6.914s0.964 4.927 2.891 6.854c1.928 1.927 4.222 2.891 6.885 2.891s4.977-0.973 6.944-2.92c1.868-1.808 2.802-4.082 2.802-6.825 0-2.721-0.949-5.032-2.847-6.929s-4.197-2.846-6.899-2.846-4.988 0.954-6.855 2.861zM14 13.779c-0.298-0.649-0.743-0.973-1.337-0.973-1.050 0-1.575 0.707-1.575 2.121s0.525 2.12 1.575 2.12c0.694 0 1.189-0.344 1.486-1.034l1.456 0.775c-0.694 1.233-1.735 1.849-3.123 1.849-1.071 0-1.928-0.328-2.572-0.984-0.645-0.657-0.967-1.561-0.967-2.715 0-1.133 0.332-2.033 0.996-2.7s1.492-1 2.484-1c1.467 0 2.518 0.578 3.153 1.733l-1.576 0.807zM20.85 13.779c-0.298-0.649-0.735-0.973-1.31-0.973-1.071 0-1.607 0.707-1.607 2.121s0.536 2.12 1.608 2.12c0.695 0 1.181-0.344 1.459-1.034l1.488 0.775c-0.693 1.233-1.732 1.849-3.118 1.849-1.069 0-1.925-0.328-2.569-0.984-0.643-0.657-0.965-1.561-0.965-2.715 0-1.133 0.327-2.033 0.98-2.7s1.484-1 2.494-1c1.465 0 2.514 0.578 3.147 1.733l-1.607 0.807z"></path>
<path fill="#fff" style="fill: var(--color3, #fff)" d="M66.291 11.594c0 4.519-3.663 8.181-8.182 8.181s-8.182-3.663-8.182-8.181c0-4.519 3.663-8.181 8.182-8.181s8.182 3.663 8.182 8.181z"></path>
<path fill="#000" style="fill: var(--color2, #000)" d="M60.476 9.227c0-0.315-0.256-0.571-0.57-0.571h-3.614c-0.314 0-0.57 0.255-0.57 0.571v3.614h1.008v4.279h2.739v-4.279h1.008v-3.614z"></path>
<path fill="#000" style="fill: var(--color2, #000)" d="M59.335 6.944c0 0.683-0.553 1.236-1.236 1.236s-1.236-0.553-1.236-1.236c0-0.683 0.553-1.236 1.236-1.236s1.236 0.553 1.236 1.236z"></path>
<path fill="#000" style="fill: var(--color2, #000)" d="M58.088 2.58c-2.447 0-4.519 0.854-6.215 2.562-1.74 1.767-2.609 3.858-2.609 6.272s0.87 4.491 2.609 6.228c1.74 1.737 3.812 2.606 6.215 2.606 2.433 0 4.541-0.875 6.325-2.628 1.681-1.663 2.521-3.732 2.521-6.206s-0.856-4.564-2.565-6.272c-1.711-1.708-3.804-2.562-6.281-2.562zM58.11 4.169c2.005 0 3.708 0.707 5.109 2.121 1.415 1.398 2.123 3.106 2.123 5.124 0 2.032-0.693 3.718-2.078 5.057-1.46 1.443-3.177 2.164-5.153 2.164s-3.679-0.714-5.109-2.142c-1.431-1.428-2.145-3.122-2.145-5.080s0.722-3.666 2.167-5.124c1.386-1.414 3.081-2.121 5.086-2.121z"></path>
</symbol>

</defs>
</svg>

<div align="center">
  <a rel="license" class="cc-logo" href="http://creativecommons.org/licenses/by/4.0/">
    <svg class="cc-logo"><use xlink:href="#icon-cc-by"></use></svg></a><br />This work is licensed under a <a rel="license"  href="http://creativecommons.org/licenses/by/4.0/">Creative Commons Attribution 4.0 International License</a>.
</div>
</div>
</body>
</html>
